{"/AppDoc/game/en/Nonograms.html":{"title":"Nonagrams","content":" title: Nonagrams class: heading_no_counter keywords: Nonagrams, solve, random, custom quantities desc: supports custom number of rows and columns up to has automatic solving function Include normal version and solve version, random mode supports custom number of rows and columns, the range is 3x3~50x50, the solve version has automatic solving function, contains more levels and professional modes. ### How to play 1. Select the game mode, the game includes random mode, level mode, char mode, symbol mode, and expert mode (**Unique to the Solve Version**). ![Nonagrams](../assets/images/nonogram1.png) 2. The random mode can choose the number of rows and columns, and the other modes can choose the level. 3. Click \"Start\" to enter the game. There are three states for cells in the game: * Blank state: The initial state, no fill and no marker, no background color * Fill Status: The numbers on the left and above are calculated for this state, with a blue background * Marking Status: Mark non filled cells with a white background ![Nonagrams](../assets/images/nonogram2.png) 4. Toggle the operation mode: Click the toggle button in the middle of the top toolbar to switch between the draw mode and the clear mode. In draw mode, use left click to toggle cell fill and blank state, and right click to toggle marking and blank state. Left and right button function swaped in clear mode. > Supports continuous drawing or clearing when mouse button pressed and dragging 5. Restart: Click the [Restart] button to clear the grid and restart the game. 6. New Game: Click [New Game] to start a new game. >! Available only in random mode 7. Automatic solving: In random mode, you can click the [Resolve] button on the right side of the top toolbar to display the results directly. 8. To exit the game: Click the [Home] button on the top toolbar to return to the home page. ### Automatic solve puzzle >! Unique to the Solve Version 1. Click [Solve Puzzle] on the home page to enter the solve setting page. ![Nonagrams](../assets/images/nonogram3.png) 2. Select the number of rows and columns, the minimum value is 3x3, and the maximum value is 50x50 3. Enter the row and column hints: Line hints are the numbers on the left side of the grid, enter each row hint in order from top to bottom, and the numbers in each row are separated by \",\", and the lines are separated by a space. Column hints are the numbers above the grid, enter each column hint in order from left to right, and the numbers in each column are separated by \",\", and the columns are separated by a space. 4. Click the [Solve] button will verify the hints, including the number of rows and columns and the format. After the verification is passed, try to solve the puzzle automatically, and the result will be displayed if it succeeds. Click the [Cancel] button to return to the home page. ![Nonagrams](../assets/images/nonogram4.png) >! Puzzles with more than one answers will pop up an error message, need to modify the hints value to continue. 1. Click the [Home] button on top of the result page to return to the home page. [Microsoft Store](https://apps.microsoft.com/detail/9NP8GH864JTW) [Solve Version](https://apps.microsoft.com/detail/9P9938FPD2MM)"},"/AppDoc/game/en/WordGame.html":{"title":"Word Guessing Game","content":" title: Word Guessing Game class: heading_no_counter keywords: Word Guessing Game, Casual Puzzle, Number, Word, Japanese, Kanji, Idiom desc: Word guessing game, including guessing numbers, words, letters, Japanese, kanji, idioms, etc This app is a collection of urls for dozens of word guessing games, including guessing numbers, English words, Chinese characters, Chinese idioms, Japanese and Korean word guessing, and more. ![WordGame](../assets/images/xxxxleGame.png) ### How to play 1. Select a category On the homepage of the game, select the game category you want to play, app contains 8 categories: * English Words: Contains a variety of English words of different lengths * English Names: English name containing country, animal, movie, car, etc * English Options: Contains multiple games with custom options, such as quantity, grouping, etc * English Others: Contains English word games with specific requirements * Chinese: Contains guessing idioms, pinyin, poetry, characters, Cantonese, etc * Other languages: Word guessing games in Japanese and Korean * Numbers: Contains different types of number guessing games * Miscellaneous: Contains a variety of other types of word guessing games, such as letters, pictures, emojis, etc Click on these category title to view the game list within the category. 2. Enter the game The category shows the name of the game in the form of a card, with the icon on the right indicating the feature of the game. Click on these cards to access the corresponding game. >! Some games may be inaccessible due to shutdowns or network issues ![WordGame](../assets/images/xxxxleGame2.png) 3. Play the game Once the game is loaded, the corresponding game page will be displayed, and you can play according to the instructions inside each game. 4. Exit the game After entering the game, there will be a menu on the left side of the page, click the first Home button to return to the home page, and the second button to refresh the page. 5. Favourite operate The first category on the homepage is the Favourite list, which can be used to quickly enter the game. The way to add is: After entering the game, click the third \"♡\" button on the left menu. If you want to remove it, you can click the delete button on the right side of the Favourite list, or you can click the third \"♡\" button in the menu again in the game page. [Microsoft Store](https://apps.microsoft.com/detail/9NLX9V1X4MRL) [PWA](https://apps.microsoft.com/detail/9N61ZN52ZCWC) This app is also available on the web and can be used [online](https://xxxxlegame.azurewebsites.net)"},"/AppDoc/game/en/ConsoleGame.html":{"title":"Console Games","content":" title: Console Games class: heading_no_counter keywords: Console Games, 2048, Tetris, Drive, Memory, Number Guess, wordle desc: A collection of console games with 12 classic games This app is a collection of console games, it include 12 classic games with a simple interface and keyboard controls. ### How to play Use the [Arrow] keys on the home page to select the game, select the game and press the [Enter] key to enter the game. > In all games, you can press [F5] to start a new game, and press the [Esc] key to return to the home page. ![Menu](../assets/images/ConsoleGame0.png) #### 2048 Use the [Arrow] keys to control and get the highest score possible ![2048](../assets/images/ConsoleGame1.png) #### Drive Use the [Arrow] keys to control, and if you hit a wall, the game will end ![Drive](../assets/images/ConsoleGame2.png) #### Light On The goal is to turn off all lights, use the [Arrow] keys to move the cursor, the [Enter] key to toggle the switch state, the [Backspace] key to restart the game, and the [F1/F2/F3] toggle number to 4x4/5x5/6x6 ![Light On](../assets/images/ConsoleGame3.png) #### Memory Find all the paired numbers by flipping, use the [Arrow] keys to move the cursor, [Enter] to flip, and [F1/F2/F3] to switch the number to 4x4/5x5/6x6 ![Memory](../assets/images/ConsoleGame4.png) #### Number Guess Guess a given number within 6 times, use the [Arrow] keys to move the cursor, [1~9] to enter the number, [Enter] to confirm, [F1/F2] to switch between 4 or 5 digits ![Number Guess](../assets/images/ConsoleGame5.png) #### PingPang Play PingPang with the computer, and the first to score 3 points wins. Use the [↑/↓] keys to move ![PingPang](../assets/images/ConsoleGame6.png) #### Reversi Play with the computer, and in the end, the player with the most pieces wins. Use [↑/↓] keys to move the cursor, and press [Enter] to confirm ![Reversi](../assets/images/ConsoleGame7.png) #### Rythm Press the corresponding [Arrow] keys when the color block lands within the gray area, and 10 mistakes will fail. ![Rythm](../assets/images/ConsoleGame8.png) #### Sliding Use the [Arrow] keys to move the numbers until all the numbers are in order from left to right and top to bottom. [F1/F2/F3] toggle the number of numbers to 8/15/24 images ![Sliding](../assets/images/ConsoleGame9.png) #### Tetris A classic Tetris game, use the [←/→] keys to move the block, the [↑] key to rotate the block, the [↓] key to accelerate the fall, and the [Spacebar] to drop directly ![Tetris](../assets/images/ConsoleGame10.png) #### TicTacToe Play a tic tac toe game with the computer, and the first to play a horizontal/vertical/diagonal triple wins. Use the [Arrow] keys to move the cursor, and press [Enter] to confirm ![TicTacToe](../assets/images/ConsoleGame11.png) #### Wordle Guess a given English word within 6 times. Use the [Arrow] keys to move the cursor, [A~Z] to enter letters, [Enter] to confirm, [F1/F2/F3] to switch 4/5/6 letter words, and [Backspace] to delete letter ![Wordle](../assets/images/ConsoleGame12.png) [Microsoft Store](https://apps.microsoft.com/detail/9NHD6FTW9WSN)"},"/AppDoc/game/en/Sudoku.html":{"title":"Sudoku","content":" title: Sudoku class: heading_no_counter keywords: Sudoku, solving, difficulty to choose desc: Classic Sudoku game with 9 levels of difficulty to choose。 This is a classic Sudoku game that supports 9 levels of difficulty selection and can automatically solve questions. ### How to play 1. Choose difficulty level, with each higher level decreasing the number of preset numbers. ![Sudoku](../assets/images/sudoku1.png) 2. Click [Start] to generate random questions. 3. Answer: select a cell and then select the number below to fill in, click \"x\" to clear the number. > Turn on [Count Hint] to prompt the count of numbers that can be filled in the cell and the times of options can be used > > Turn on [Auto Exclude] to automatically exclude unavailable items from the options ![Sudoku1](../assets/images/sudoku2.png) 4. Exit & Restart: Click the [Home] button to return to the home page, and click [Restart] to clear the current number and start again. ### Solve automatically 1. On the home page, click [Solve] to enter the problem solving mode. 2. The grid is blank by default, fill in the known value by selecting the position and then clicking on the number, and the number that cannot be filled in will be automatically excluded when filling in the preset numbers. ![Sudoku2](../assets/images/sudoku3.png) 3. Click [AutoSolve] to automatically fill in the answer (Auto Solve only supports one answer). 4. Click [Restart] to clear the grid and start again. [Microsoft Store](https://apps.microsoft.com/detail/9PJXNP3T8V00)"},"/AppDoc/game/en/Yahtzee.html":{"title":"Yahtzee","content":" title: Yahtzee class: heading_no_counter keywords: Yahtzee, AI, multiplayer, console game desc: Yahtzee Game, support play with computer and 2~4 player multiplayer game Yahtzee game running on the console, supporting play with computer and 2~4 player multiplayer game. ### How to play 1. Use the [←/→] keys on the home page to select the number of players, press the [Enter] key to confirm, and select 1 player to play with the computer. ![Yahtzee1](../assets/images/Yahtzee1.png) 2. After entering the game, roll the dice above, use the [←/→] keys to select the operation, and the [Space] or [Enter] key to confirm. When the number is selected, you can toggle the lock state, green on the left to make a roll, and red on the right to skip the roll for scoring. 3. After rolling 3 times or skipping the roll, enter the scoring stage, use the [↑/↓] keys to select the scoring type, and the [Space] or [Enter] keys to confirm. 4. After the score is confirmed, the next player will roll, and multiple players will take turns in turn. 5. The game ends when each player's 13 points are filled up, and the player with the highest total score wins. ![Yahtzee2](../assets/images/Yahtzee2.png) > When playing with a computer, the computer will operate automatically without the user's involvement. > > You can use the [F5] key to start a new game during or after the game, and the [Esc] key to return to the home page. [Microsoft Store](https://apps.microsoft.com/detail/9NXDKGM9RS97)"},"/AppDoc/game/en/index.html":{"title":"Games","content":" title: Games class: heading_no_counter keywords: Minesweeper, Sudoku, Nonograms, Word guessing game desc: Game Apps, include minesweeper, Sudoku, Nonograms, and Word guessing games ## Introduce Casual puzzle games are a class of games designed for recreational entertainment and mind training, suitable for relaxing and exercising the brain. These games usually have a simple gameplay and can often be played in a short period of time, making them perfect for relaxing in fragmented time and allowing players to enjoy in their leisure time while also challenging their thinking skills and problem solving skills. IceSky offers four games of this type in the Windows Store: * [Word Guessing Games](./WordGame.html) Word guessing games were first introduced in the mid 20th century as number guessing games, and later developed in several variants. > **Rules** > > The general goal of this type of game is to find out the pre given numbers, words, letters, etc., within a specified number of times. Each guess is followed by a pattern or color that points out the difference between each guess and the correct answer, and the player needs to deduce the correct answer based on this feedback. This game tests the player's patience and reasoning skills. * [Minesweeper](./Minesweeper.html) The game of Minesweeper originated from the 1973 game of \"Cube\". In 1992, Microsoft released Windows 3.1 to add the game, and since then it has been popular all over the world. > **Rules** > > A certain number of mines are randomly placed in the grid, and the player flips through the blocks one by one to find all the mines as the final game goal. If the player flips over a block with mines, the game is over. If a number appears on a block, the number indicates the number of mines in the 3×3 area around it, and the player needs to deduce the location of the mines based on the numbers and mark them. Playing minesweeper games can exercise observation and reasoning skills, and cultivate carefulness and patience. * [Sudoku](./Sudoku.html) Sudoku is a number logic game that originated in Switzerland at the end of the 18th century, developed in the United States, and popularized in Japan. > **Rules** > > In a 9x9 grid, each cell is divided into a 3x3 grid. The goal of the game is to fill in the numbers 1 to 9 in each space so that the numbers in each row, column, and small square are not repeated. At the beginning of the game, the grid is pre filled with numbers as clues, and the player needs to reason based on these clues to fill in the remaining spaces. Sudoku requires players to think strategically, analyze possibilities, and make informed decisions, and solving Sudoku puzzles regularly improves critical thinking, logical reasoning, problem solving, and pattern recognition. * [Nonograms](./Nonograms.html) Nonograms is a game that originated in Japan. > **Rules** > > The numbers on the top and left of a rectangular grid represent the number of consecutive color patches in the corresponding grid column or row, and the player needs to deduce the position of the color patches in the grid and fill in the color through these numbers, until all the color blocks are filled. It not only exercises the player's logical thinking and spatial imagination skills, but also improves concentration and concentration. In the process of solving puzzles, players need to remain calm and observant, and these qualities are equally important for daily life and work. * [Console Games](./ConsoleGame.html) A collection of console games containing 12 classic games such as 2048, Tetris, Tic tac toe, Flip Chess, Number Guess, Wordle, etc. * [Yahtzee](./Yahtzee.html) Each player takes turns rolling five dice, with a maximum of three rolls per turn. Players can choose to keep as many dice as they want after each roll and reroll other dice. The goal of the game is to get the highest score possible in 13 different scoring positions. Scoring Rules: * 1: 1 point for each 1 * 2: 2 points for each 2 * 3: 3 points for each 3 * 4: 4 points for each 4 * 5: 5 points for each 5 * 6: 6 points for each 6 * 3 of a kind: Get three dice with the same number. Points are the sum all dice * 4 of a kind: Get four dice with the same number. Points are the sum all dice * Full house: Get three of a kind and a pair, e.g. 1,1,3,3,3 or 3,3,3,6,6. Scores 25 points * Small straight: Get four sequential dice, 1,2,3,4 or 2,3,4,5 or 3,4,5,6. Scores 30 points * Large straight: Get five sequential dice, 1,2,3,4,5 or 2,3,4,5,6. Scores 40 points. * Yahtzee: 50 points if there are five of the same dice * Chance: Sum up all the dice Bonus: 1. The sum of the upper numbers 1 to 6 is 63 or more points, and 35 bonus points will be awarded 2. If the score has been scored at the Yahtzee place, 100 additional bonus points will be awarded for each additional Yahtzee rolled"},"/AppDoc/game/en/Minesweeper.html":{"title":"Minesweeper","content":" title: Minesweeper class: heading_no_counter keywords: Minesweeper, Custom difficulty desc: Minesweeper，support set custom quantities, including three styles This app implements the classic Minesweeper gameplay, with 3 predefined styles to choose. ### How to play 1. On the home page, select the difficulty level, you can choose from 3 predefined levels, or you can choose to customize to set the number of rows, columns and mines. ![Minesweeper](../assets/images/Mine1.png) 2. You can choose one of the three predefined styles and click Start Game to enter the game. 3. Mode switching: After entering the game, the button on the right side of the [New Game] in the top menu bar can switch between the flip mode and the flag mode. 4. Flip operation: Left click the unflaged grid in flip mode to flip it open, in flag mode use right click to flip it open. 5. Flag operation: Right click the grid in flip mode to switch flag, and left click in flag mode to do this. 6. Quick flip: Click on the number (left or right click), if the number of 3x3 range flags around this grid is the same as the number, will quickly open all unflaged grids in the 3x3 range. 7. Result determine: All non mine grid are turned over is success, and turning over any one mine grid is failure. 8. After entering the game, click the [New Game] button in the top menu bar can start a new game, and the mine position will be rearranged. 9. Click the leftmost button on the top menu bar to return to the home page. ### Style 1 ![Minesweeper](../assets/images/Mine2.png) ### Style 2 ![Minesweeper](../assets/images/Mine3.png) ### Style 3 ![Minesweeper](../assets/images/Mine4.png) [Microsoft Store](https://apps.microsoft.com/detail/9NCS89MQ8P5N)"},"/AppDoc/game/en/no_translate.html":{"title":"no translation","content":" title: no translation class: md_page <div id \"visit_from\"></div> <div id \"no_translate_hint\">This page not translated yet</div> <div> <span id \"visit_hint\">Please visit</span> <a id \"translate_src\"></a> </div> <div> <script> function getQueryVariable(variable) { var query window.location.search.substring(1); var vars query.split(\"&\"); for (var i 0;i<vars.length;i++) { var pair vars[i].split(\" \"); if(pair[0] variable){return pair[1];} } return(false); } var ref getQueryVariable(\"ref\"); var from getQueryVariable(\"from\"); var link document.getElementById(\"translate_src\"); var fromDis document.getElementById(\"visit_from\"); link.href ref; link.text ref; fromDis.innerHTML from; </script> </div>"}}