{"/AppDoc/game/zh/Minesweeper.html":{"title":"扫雷","content":" title: 扫雷 class: heading_no_counter keywords: 扫雷, 自定义难度 desc: 扫雷，支持自定义数量，包含三种样式 此应用实现了经典扫雷的玩法，有3种预定义样式以供选择。 ### 操作方法 1. 在首页选择难度级别，难度可选预定义的3个级别，也可以选择自定义，自定义可以设置行列数和雷数。 ![扫雷1](../assets/images/Mine1.png) 2. 可以选择三种预定义风格中的一种，点击开始游戏进入游戏。 3. 模式切换：进入游戏后，上方菜单栏【新游戏】右侧按钮可以切换翻开模式和标记模式。 4. 翻开操作：翻开模式下左键点击无标记格子会直接翻开，标记模式下右键点击执行翻开。 5. 标记操作：翻开模式下右键点击格子可以切换标记，标记模式下左键点击执行此操作。 6. 快速翻开：点击数字（左右键均可），若此格子周围3x3范围标记数量和数字一致，则可快速翻开3x3范围内的全部未标记格子。 7. 结果判定：所有非地雷格子全部翻开即为成功，翻开地雷即为失败。 8. 进入游戏后，上方菜单栏【新游戏】按钮可以开始新的游戏，地雷位置会重新布置。 9. 点击上方菜单栏最左侧按钮可以返回首页重新设置。 ### 样式1 ![扫雷1](../assets/images/Mine2.png) ### 样式2 ![扫雷2](../assets/images/Mine3.png) ### 样式3 ![扫雷3](../assets/images/Mine4.png) [商店下载](https://apps.microsoft.com/detail/9NCS89MQ8P5N)"},"/AppDoc/game/zh/Nonograms.html":{"title":"数织","content":" title: 数织 class: heading_no_counter keywords: 数织, 解题, 随机题目, 自定义数量 desc: 数织游戏，支持自定义行列数量，最大50*50，支持自动求解 分为普通版和解题版，随机模式支持自定义行列数量，范围为3\\*3~50\\*50，解题版具备自动求解功能，以及更多的关卡和专业模式。 ### 操作方法 1. 选择游戏模式，游戏包含随机模式、闯关模式、文字模式、符号模式、专业模式（**解题版特有**）。 ![数织1](../assets/images/nonogram1.png) 1. 随机模式可以选择行数和列数，其他模式可以选择关卡。 2. 点击“Start”进入游戏。 游戏中单元格有三种状态： * 空白状态：即初始状态，没有填充也没有被标记，无背景色 * 填充状态：左侧和上方数字计算的为此状态，背景为蓝色 * 标记状态：标记非填充单元格，背景为白色 ![数织2](../assets/images/nonogram2.png) 4. 切换操作模式：点击上方工具栏中间的切换按钮可以切换绘制模式和清除模式。 绘制模式下左键切换单元格填充和空白状态，右键切换标记和空白状态。 清除模式下左右键功能交换。 > 操作时支持按下拖动时连续绘制或清除 5. 重新开始：点击【Restart】按钮可以清空界面重新开始本局游戏。 6. 新游戏：点击【New Game】可以开始一局新游戏。 >! 只有随机模式下可以开始新游戏 7. 自动解题：随机模式下点击上方工具栏右侧的【Resolve】按钮可以直接显示结果。 8. 退出游戏：点击上方工具栏的【Home】按钮返回到首页。 ### 自动求解 >! 解题版特有功能 1. 在首页点击【Solve Puzzle】进入解题设置界面。 ![数织3](../assets/images/nonogram3.png) 2. 选择行数和列数，最小值为3x3，最多支持50x50 3. 输入行列提示： 行提示即网格左侧数字，按照从上到下的顺序输入每行提示，每行的数字用“,”分隔，行之间用空格分隔。 列提示即网格上方数字，按照从左到右的顺序输入每列提示，每列的数字用“,”分隔，列之间用空格分隔。 4. 点击【Solve】按钮会对输入的提示进行验证，包括验证行列数量和格式。 验证通过后会尝试进行解题，解题成功后会显示结果。 点击【Cancel】按钮可以返回首页。 ![数织4](../assets/images/nonogram4.png) >! 答案不唯一的谜题会弹出错误信息，需要修改提示数值才能继续。 5. 在解题结果界面点击【Home】按钮返回首页。 [商店下载](https://apps.microsoft.com/detail/9NP8GH864JTW) [解题版](https://apps.microsoft.com/detail/9P9938FPD2MM)"},"/AppDoc/game/zh/index.html":{"title":"游戏","content":" title: 游戏 class: heading_no_counter keywords: 扫雷, 数独, 数织, 猜词游戏, 休闲益智 desc: 游戏类应用，包含扫雷, 数独, 数织, 猜词游戏 ## 介绍 休闲益智类游戏是一类专为休闲娱乐和思维训练而设计的游戏，适合放松和锻炼大脑。这些游戏通常具有简单的玩法，通常可以在短时间内进行一局游戏，非常适合在碎片化的时间里放松自己，可供玩家在休闲时间享受，同时也可以挑战自己的思维能力和解决问题的能力。 IceSky在Windows商店中提供了四个这种类型的游戏： * [猜词游戏](./WordGame.html) 猜词游戏中最早出现的是20世纪中期的猜数字游戏，后来发展出多种变体。 > **规则** > > 这类游戏的一般目标是在指定次数内找出预先给出的数字、单词、字母等。每次猜词之后都会用图案或颜色指出猜测的每个位置和正确答案的区别，玩家需要根据这些反馈推理出正确答案。 这个游戏考验玩家的耐心和推理能力。 * [扫雷](./Minesweeper.html) 扫雷游戏起源于1973年的\"方块\"游戏。1992年微软发布的Windows 3.1中加入该游戏，从此风靡全世界。 > **规则** > > 在网格中随机布置一定量的地雷，由玩家逐个翻开方块，以找出所有地雷为最终游戏目标。如果玩家翻开的方块有地雷，则游戏结束。如果方块上出现数字，则该数字表示其周围3×3区域中的地雷数，玩家需要根据数字推断地雷位置并标记。 玩扫雷游戏，可以锻炼观察和推理能力，培养细心和耐心。 * [数独](./Sudoku.html) 数独（Sudoku）是一种源自18世纪末的瑞士，后在美国发展、并在日本得以发扬光大的数字逻辑游戏。 > **规则** > > 在一个9x9的网格中，每个小格子都被划分为一个3x3的小宫格。游戏的目标是在每个空格中填入数字1到9，使得每行、每列和每个小宫格内的数字都不重复。游戏开始时，网格中会预先填入一些数字作为线索，玩家需要根据这些线索进行推理，填充剩余的空格。 数独游戏要求玩家进行战略思考、分析可能性和做出明智的决策，经常解决数独谜题能够提高批判性思维、逻辑推理、问题解决能力和模式识别能力。 * [数织](./Nonograms.html) 数织即Nonograms，也有的翻译为数图或逻辑绘图，是源于日本的一个游戏。 > **规则** > > 在一个矩形网格的上边和左边标这一些数字，这些数字代表其对应的网格列或行中连续色块的数量，玩家需要通过这些数字推断出网格中色块的位置并进行填色，所有色块全部填充即算成功。 它不仅能够锻炼玩家的逻辑思维和空间想象能力，还能够提高注意力和专注力。在解决数织谜题的过程中，玩家需要保持冷静、细心观察，这些品质对于日常生活和工作同样具有重要意义。"},"/AppDoc/game/zh/Sudoku.html":{"title":"数独","content":" title: 数独 class: heading_no_counter keywords: 经典数独, 解题, 多个级别 desc: 经典的数独游戏，9级难度选择 这是一款经典的数独游戏，支持9级难度选择，可以自动解答题目。 ### 操作方法 1. 选择难度级别，共分为9级，每高一级会减少预置数字。 ![数独1](../assets/images/sudoku1.png) 2. 点击【生成题目】可以自动生成随机题目。 3. 解答，选中格子后在下方选择数字填入，点击“x”可以清除数字。 > 开启【数量提示】可以提示单元格可填的数字个数和备选数字可用次数 > > 开启【自动排除】可以自动排除备选数字中的不可用项。 ![数独2](../assets/images/sudoku2.png) 4. 退出及重新开始： 点击首页按钮可以回到首页，点击重新开始可以清空当前数字重新作答。 ### 自动求解 1. 在首页点击【求解题目】进入解题模式。 2. 解题界面默认为空，通过选中位置再点击数字填入已知值，填入已知值时会自动排除不可填入的数字。 3. 点击【自动解答】即可自动填入答案（自动解答只支持一个答案）。 4. 点击【重新开始】可以清空界面重新开始。 ![数独3](../assets/images/sudoku3.png) [商店下载](https://apps.microsoft.com/detail/9PDGSF0P8NT9)"},"/AppDoc/game/zh/WordGame.html":{"title":"猜词游戏","content":" title: 猜词游戏 class: heading_no_counter keywords: 猜词游戏, 休闲益智, 数字, 单词, 日语, 汉字, 成语 desc: 猜词游戏，包含猜数字、单词、字母、日语、汉字、成语等 ## 介绍 此应用集合了数十款猜词类游戏的地址，其中包括猜数字、英文单词、中文汉字、中文成语、日韩语猜词等。 ![猜词游戏](../assets/images/xxxxleGame.png) ### 操作方法 1. 选择分类 在游戏首页选择想要进行的游戏分类，类别分为8种： * 英文单词类：包含各种不同长度的英文单词 * 英文名称类：包含国家、动物、电影、车等的英文名称 * 英文带选项类：包含多个具有自定义选项的游戏，比如数量、分组等 * 英文其他类：包含具有特定要求的英文单词游戏 * 中文类：包含猜成语、猜拼音、猜诗词、猜文字、猜粤语等 * 其他语言类：包含日语和韩语的猜词游戏 * 数字类：包含不同类型的猜数字游戏 * 其他类：包含各种其他类型的猜词游戏，比如字母、图片、表情等 点击这些分类标题可以查看分类中的目录。 1. 进入游戏 分类目录中以卡片的形式展示了其中的游戏名称，右侧图标表示此游戏的特色。点击这些卡片就可以进入相应游戏。 >! 有的游戏可能因为关闭或网络问题无法访问 ![猜词游戏](../assets/images/xxxxleGame1.png) 2. 进行游戏 游戏加载完成后会显示相应的游戏界面，可以根据各个游戏内部的说明进行游戏。 大部分游戏操作方式都是点击下方选项卡选取内容后进行验证（部分游戏支持键盘输入），提示信息方式可能有所不同。 3. 退出游戏 进入游戏后，界面左侧会有一个菜单，点击第一个Home按钮即可返回首页，第二个按钮可以刷新界面。 4. Favourite 操作 首页第一个类别就是Favourite列表，可以将游戏添加到此列表的来快速进入。添加方式为：进入游戏后，点击左侧菜单的第三个“♡”按钮即可。想要移除时在Favourite列表点击右侧删除按钮即可，也可以在游戏界面再次点击菜单的第三个“♡”按钮。 [商店下载](https://apps.microsoft.com/detail/9NLX9V1X4MRL) [PWA版](https://apps.microsoft.com/detail/9N61ZN52ZCWC) 此应用也有网页版，可以[在线使用](https://xxxxlegame.azurewebsites.net)"}}